In [78]:
import json
import pandas as pd

In [3]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [4]:
result = json.loads(obj)

In [5]:
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [7]:
dataset = pd.read_html('examples/fdic_failed_bank_list.html')

In [9]:
failures = dataset[0]

In [34]:
failures.head(10)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"
5,Hometown National Bank,Longview,WA,35156,Twin City Bank,"October 2, 2015","April 13, 2016"
6,The Bank of Georgia,Peachtree City,GA,35259,Fidelity Bank,"October 2, 2015","October 24, 2016"
7,Premier Bank,Denver,CO,34112,"United Fidelity Bank, fsb","July 10, 2015","August 17, 2016"
8,Edgebrook Bank,Chicago,IL,57772,Republic Bank of Chicago,"May 8, 2015","July 12, 2016"
9,Doral Bank En Espanol,San Juan,PR,32102,Banco Popular de Puerto Rico,"February 27, 2015","May 13, 2015"

In [26]:
type(failures['Closing Date'][0])

str

In [37]:
failures['Closing Date'] = pd.to_datetime(failures['Closing Date'])

In [40]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,2016-09-23,"November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,2016-08-19,"November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,2016-05-06,"September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,2016-04-29,"September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,2016-03-11,"June 16, 2016"

In [63]:
failures['Closing Date'].dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

In [76]:
mask = (failures['Closing Date'] > '2010-11-30') & (failures['Closing Date'] < '2010-12-31')

In [77]:
failures.loc[mask]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
198,Community National Bank,Lino Lakes,MN,23306,Farmers & Merchants Savings Bank,2010-12-17,"November 10, 2016"
199,First Southern Bank,Batesville,AR,58052,Southern Bank,2010-12-17,"August 20, 2012"
200,"United Americas Bank, N.A.",Atlanta,GA,35065,State Bank and Trust Company,2010-12-17,"October 17, 2015"
201,"Appalachian Community Bank, FSB",McCaysville,GA,58495,Peoples Bank of East Tennessee,2010-12-17,"March 21, 2014"
202,Chestatee State Bank,Dawsonville,GA,34578,Bank of the Ozarks,2010-12-17,"September 21, 2015"
203,"The Bank of Miami,N.A.",Coral Gables,FL,19040,1st United Bank,2010-12-17,"March 21, 2014"
204,Earthstar Bank,Southampton,PA,35561,Polonia Bank,2010-12-10,"August 20, 2012"
205,Paramount Bank,Farmington Hills,MI,34673,Level One Bank,2010-12-10,"September 21, 2015"